<?php

$g5['title'] = "ABEEK";
include_once('./_common.php');
include_once('./_head.php');
?>
<!--본문 시작-->
<div class="contents-wrapper">
    <!--사이드메뉴-->
    <div class="side-menu">
        <header class="sidemenuheader" role="banner">
            <h1 class="logo">
                <a href="">
                    <span>공학인증</span></a>
            </h1>
            <div class="nav-wrap">
                <nav class="main-nav" role="navigation">
                    <ul class="unstyled list-hover-slide">
                    <li><a href="/2_1_abeek.php">공학인증소개</a></li>
                    <li><a href="/2_2_abeek.php">프로그램 내규</a></li>
                    <li><a href="/2_3_abeek.php">예비 지식</a></li>
                    <li><a href="/2_4_abeek.php">교육목표</a></li>
                    <li><a href="/2_5_abeek.php">학습성과</a></li>
                    <li><a href="/2_6_abeek.php">교과목이수체계</a></li>
                    <li><a href="/2_7_abeek.php">인증기준(KCC2015)</a></li>

                    </ul>
                </nav>
            </div>
        </header>
    </div>
    <!--본문 컨텐츠-->
    <div class="contents">
        <div class="navigator">
            홈 > ABEEK > 교육목표
        </div>
        <div class="contents-header">
            교육목표
        </div>
        <div class="contents-body">
            <div class="bodytitle">
                컴퓨터 소프트웨어 공학과 교육목표
            </div>
            <div class="normaltext">
                <table width="666" border="0" cellspacing="0" cellpadding="0">
                    <tbody>
                        <tr>
                            <td height="10" colspan="2"></td>
                        </tr>
                        <tr>
                            <td width="0"></td>
                            <td class="tvdate">컴퓨터소프트웨어공학과는 인터넷, 정보보호, 멀티미디어 처리, 소프트웨어공학, 임베디드 소프트웨어 등 다양한
                                컴퓨터 소프트웨어에 대한 폭넓은 이해를 위해 기초과학, 컴퓨터 소프트웨어 공학 기술, 소프트웨어 도구 활용 능력을 바탕으로 한 공학 기초 능력과
                                도구 활용 능력을 배양하고 습득한 지식과 창의적인 사고를 발휘하여 다양한 공학 분야에 응용할 수 있고, 종합적으로 설계할 수 있는 능력을
                                배양함과 동시에 관련 산업체와 연구기관 등에서 필요로 하는 실무 수행 능력과 효과적으로 의사를 전달 할 수 있는 능력을 배양하고 건전한
                                윤리의식과 책임의식을 바탕으로 국제화 시대를 이끌어 나갈 능력을 갖춘 능동적이고 창의적인 컴퓨터 소프트웨어 전문 기술 인력 양성을 교육목표로
                                한다.</td>
                        </tr>
                        <tr>
                            <td width="0" class="tvdate"> </td>

                        </tr>
                        <tr>
                            <td width="0"></td>
                            <td colspan="2" class="text04">

                                <p>

                                    <br/>본 프로그램의 교육목표는 네 가지 세부 교육목표로 이루어지며 각 세부 교육목표에서 추구하는 방향은 다음과 같다.<br/><br/></p>
                                <p>
                                    <b>가. 공학 기초 능력과 도구 활용 능력 배양
                                    </b>
                                </p>
                                <p>1) 세부 교육목표</p>
                                <p>기초과학, 컴퓨터 소프트웨어 공학 기술, 소프트웨어 도구 활용 능력을 바탕으로 한 공학 기초 능력과 도구 활용 능력 배양
                                </p>
                                <p>2) 추구방향</p>
                                <p>본 프로그램 소속 학생은 기초과학의 중요한 이론을 이해하고, 컴퓨터소프트웨어공학 전공과 관련된 다양한 도구를 습득함으로써, 기초과학을
                                    바탕으로 체계적인 전공능력을 향상시킬 수 있으며, 능숙한 전공 도구 활용을 바탕으로 실무능력을 향상시킬 수 있다.

                                </p>
                                <p>
                                    <b>나. 응용 능력과 설계 능력 배양
                                    </b>
                                </p>
                                <p>1) 세부 교육목표</p>
                                <p>습득한 지식을 응용하고 창의적인 사고를 발휘하여 다양한 공학 분야에 응용할 수 있고, 종합적으로 설계할 수 있는 능력 배양</p>
                                <p>
                                    2) 추구방향</p>
                                <p>본 프로그램 소속 학생은 컴퓨터 하드웨어, 컴퓨터 소프트웨어, 컴퓨터 시스템과 관련된 구성요소에 대하여 설계 요소를 이해하고, 제시된
                                    문제에 대한 현실적 해결방안을 도출하고 해결함으로써, 컴퓨터소프트웨어공학과 관련된 다양한 공학적 문제해결 능력을 향상시킬 수 있으며, 설계
                                    구성요소 및 제한요소 등에 대한 인식을 바탕으로 체계적인 설계능력을 향상시킬 수 있다.</p>
                                <p>
                                    <b>다. 실무 능력과 의사 전달 능력 배양</b>
                                </p>
                                <p>1) 세부 교육목표</p>
                                <p>관련 산업체와 연구기관 등에서 필요한 실무 수행 능력과 효과적인으로 의사를 전달 할 수 있는 능력 배양
                                </p>
                                <p>2) 추구방향</p>
                                <p>본 프로그램 소속 학생은 컴퓨터소프트웨어공학 전공과 관련하여 실험을 계획하고 실험결과에 대하여 종합적으로 분석하며, 객관적 사실에 근거하여
                                    논리적으로 실무 수행 절차를 표현함으로써, 실무적 현장에 적응하는 실무능력을 향상시킬 수 있으며, 실무를 통해 인식한 다양한 실무지식을 타인에게
                                    효과적으로 전달하는 의사전달능력을 향상시킬 수 있다.

                                </p>
                                <p>
                                    <b>라. 책임의식과 국제화 능력 배양
                                    </b>
                                </p>
                                <p>1) 세부 교육목표</p>
                                <p>건전한 윤리적 사고와 책임의식을 바탕으로 국제화 시대를 이끌어 나갈 능력 배양
                                </p>
                                <p>2) 추구방향</p>
                                <p>본 프로그램 소속 학생은 정보 윤리와 직업적 책임의 필요성을 인식하고 외국어로 전공 지식을 논리적으로 표현함으로써, 지역사회 및 국가에
                                    이바지하기 위한 책임의식을 배양시킬 수 있으며, 국제적 공학도로서 윤리적 사고와 직업적 책임의식을 배양시킬 수 있다.
                                </p>
                            </td>
                        </tr>

                    </tbody>
                </table>

            </div>

            <div class="bodytitle">
                ICT 공과대학 교육목표
            </div>
            <div class="normaltext">
                ICT 공과대학은 진리,정의,창의 정신을 바탕으로 윤리의식과 책임의식을 갖추고 지식 정보화 사회에기여하는 IT 분야와 디지털 미디어 분야의 실무
                전문인력 양성을 교육목표로 한다. 이를 위하여 기초과학에 대한 전반적인 통찰력과 IT 및 디지털 문화에 대한 깊은이해로부터 창의적
                개발능력,전문적 실무능력, 그리고 정보화 및 글로벌화에 능동적으로 대처하는 능력을 배양하는 전문교육을 실현한다.
                <br/><br/>
                <p>1. 기초과학과 공학기반 교육: 풍부한 기초과학 및 공학기반 교육으로 전공 응용 능력 배양</p>
                <p>2. 현장중심의 창의적 기술인: 산업현장 중심의 실무 교육으로 폭 넓은 적응 능력을 갖춘 전문 지식인 양성</p>
                <p>3. 책임감 있는 건전한 사회인: 인성교육을 토대로 윤리의식과 책임의식을 갖춘 건전한 사회인 양성
                </p>
                <p>4. 지역 및 국가산업을 선도하는 지도자: 글로벌 사회에서 지역,국가산업 발전에 선도적역할을 수행할 수 있는 전문 지도자 양성</p>
            </div>

        </div>
    </div>
</div>

<?php
include_once("./_tail.php");
?>
